f# -*- mode:org -*-
#+startup:fold
  *bpip1b0* : positive pion beam, produce stopped pion output file, default configuration 
  with 0.7T magnetic field
  pi+ lifetime is ON, use for validating the weighted simulation
# ----------------------------------------------------------------------------------------------------
 - directory       : file:./
 - configuration   : [[file:./init_project.py][init_project.py]]
 - submitted jobs  : file:../AAA_SUBMITTED_JOBS
 - grid input      : file:/pnfs/mu2e/resilient/users/murat/
 - grid output     : file:/pnfs/mu2e/scratch/users/murat/workflow
 - output_location : file:/mu2e/data2/users/murat/
 - catalogs        : file:./catalog
 - fcl             : file:../../tmp/pipenu/fcl
# ----------------------------------------------------------------------------------------------------
|------------------+------------------+-----------------+-----------+----------+---------------------------------------------------------------------------------------------|
| stage            | step             | status          | N(events) | N(files) | org file                                                                                    |
|------------------+------------------+-----------------+-----------+----------+---------------------------------------------------------------------------------------------|
| [[file:catalog/s1/su2020.736_6013.s1.org][s1_sim]]           | input_dataset    | bmum0b0s00r0000 | 100000000 |          | none                                                                                        |
|                  | fcl_tarball      | completed       | 100000000 |      249 | file:../tmp_fcl/su2020.bmum.gen_50_200000.s1_sim.fcl.tbz                                    |
| [2020-06-20 Sat] | grid_job         |                 |           |          | file:/pnfs/mu2e/scratch/users/murat/workflow/su2020.bmum.s0_gen.s1_sim/outstage/xxxxxxxx/00 |
** stage 1 (up to DS)                                                                                         

|    nevents | mode  | BField           | N(mu) | N(muon stops) | N(oot) |    CPU |    real | comment                   |
|------------+-------+------------------+-------+---------------+--------+--------+---------+---------------------------|
|      10000 | debug |                  |       |               |        | 939.23 | 730.937 |                           |
|      10000 | prof  |                  |       |               |        | 383.67 | 224.188 |                           |
|      20000 | prof  | bfgeom_v01       |    74 |            28 |        | 701.42 | 383.228 |                           |
|      20000 | prof  | bfgeom_no_ds_v01 |    73 |            25 |        | 701.42 | 383.228 |                           |
|     200000 | prof  | bfgeom_no_ds_v01 |   883 |           317 |    539 |        |         |                           |
|     200000 | prof  | bfgeom_v01       |   887 |           332 |    532 |        |         |                           |
|------------+-------+------------------+-------+---------------+--------+--------+---------+---------------------------|
| w/o offset |       |                  |       |               |        | 317.75 |         |                           |
|  per event |       |                  |       |               |        | 3.2e-2 |         | count on 100K events/hour |
|            |       |                  |       |               |        |        |         |                           |
#+TBLFM: @4$7=@3$7-@2$7

MemReport  ---------- Memory summary [base-10 MB] ------
MemReport  VmPeak = 2690.95 VmHWM = 1964.63
